Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: Building and running your own :term:`buildtools` installer applies only when you have a build host that can already run BitBake. In this case, you use that machine to build the ``.sh`` file and then take steps to transfer and run it on a machine that does not meet the minimal Git, tar, and Python (or gcc) requirements.
it_it: La creazione e l'esecuzione del proprio programma di installazione di :term:`buildtools` è possibile solo se si dispone di un host di build in grado di eseguire BitBake. In questo caso, si utilizza tale macchina per creare il file ``.sh`` e quindi si procede al trasferimento e all'esecuzione su una macchina che non soddisfa i requisiti minimi di Git, tar e Python (o gcc).

source: Buildtools generation
it_it: Generazione di buildtools

source: By convention, layer names start with the string "meta-".
it_it: Per convenzione, i nomi dei layer iniziano con la stringa "meta-".

source: By convention, layers are placed side-by-side.
it_it: Per convenzione, i layer vengono posizionati uno accanto all'altro.

source: By convention, layers in the Yocto Project follow a specific form. Conforming to a known structure allows BitBake to make assumptions during builds on where to find types of metadata. You can find procedures and learn about tools (i.e. ``bitbake-layers``) for creating layers suitable for the Yocto Project in the ":ref:`dev-manual/layers:understanding and creating layers`" section of the Yocto Project Development Tasks Manual.
it_it: Per convenzione, i layer in Yocto Project seguono una struttura specifica. Conformarsi a una struttura nota consente a BitBake di fare delle ipotesi durante la compilazione su dove trovare i diversi tipi di metadati. È possibile trovare procedure e informazioni sugli strumenti (ad esempio ``bitbake-layers``) per la creazione di layer adatti a Yocto Project nella sezione ":ref:`dev-manual/layers:understanding and creating layers`" del Manuale di Sviluppo dei Task di Yocto Project.

source: By default, :ref:`ref-classes-sbom-cve-check` uses the recipe name :term:`BPN` as CVE product name when querying the CVE database. If this mapping contains false positives, e.g. some reported CVEs are not for the software component in question, or false negatives like some CVEs are not found to impact the recipe when they should, then the problems can be in the recipe name to CVE product mapping. These mapping issues can be fixed by setting the :term:`CVE_PRODUCT` variable inside the recipe. This defines the name of the software component in the upstream `NIST CVE database <https://nvd.nist.gov/>`__.
it_it: Per default, :ref:`ref-classes-sbom-cve-check` utilizza il nome della ricetta :term:`BPN` come nome prodotto CVE quando interroga il database CVE. Se questa mappatura contiene falsi positivi, ad esempio Alcune vulnerabilità CVE segnalate potrebbero non riguardare il componente software in questione, oppure potrebbero verificarsi falsi negativi, ad esempio alcune vulnerabilità CVE non risultano avere un impatto sulla ricetta quando invece dovrebbero. In questi casi, il problema potrebbe risiedere nella mappatura tra il nome della ricetta e il prodotto CVE. Questi problemi di mappatura possono essere risolti impostando la variabile :term:`CVE_PRODUCT` all'interno della ricetta. Questa variabile definisce il nome del componente software nel `database CVE NIST <https://nvd.nist.gov/>`__ upstream.

source: By default, Git adds a signature line at the end of patches containing the Git version. We suggest to remove it as it doesn't add useful information.
it_it: Per default, Git aggiunge una riga di firma alla fine delle patch contenente la versione di Git. Si consiglia di rimuoverla in quanto non aggiunge informazioni utili.

source: By default, Toaster binds to the loop back address (i.e. ``localhost``), which does not allow access from external hosts. To allow external access, use the ``WEBPORT`` parameter to open an address that connects to the network, specifically the IP address that your NIC uses to connect to the network. You can also bind to all IP addresses the computer supports by using the shortcut "0.0.0.0:port".
it_it: Per si associa all'indirizzo di loopback (ovvero ``localhost``), che non consente l'accesso da host esterni. Per consentire l'accesso esterno, utilizzare il parametro ``WEBPORT`` per aprire un indirizzo che si connetta alla rete, in particolare l'indirizzo IP utilizzato dalla scheda di rete per connettersi alla rete. È anche possibile associarsi a tutti gli indirizzi IP supportati dal computer utilizzando la scorciatoia "0.0.0.0:port".

source: By default, Toaster starts on port 8000. You can use the ``WEBPORT`` parameter to set a different port. For example, the following command sets the port to "8400"::
it_it: Per default, Toaster si avvia sulla porta 8000. Si può utilizzare il parametro ``WEBPORT`` per impostare una porta diversa. Ad esempio, il seguente comando imposta la porta su "8400"::

source: By default, ``foo-dev`` also has an :term:`RDEPENDS`-style dependency on ``foo``, because the default value of ``RDEPENDS:${PN}-dev`` (set in ``bitbake.conf``) includes "${PN}".
it_it: Per default, ``foo-dev`` ha anche una dipendenza di tipo :term:`RDEPENDS` da ``foo``, poiché il valore di default di ``RDEPENDS:${PN}-dev`` (impostato in ``bitbake.conf``) include "${PN}".

source: By default, ``patchtest`` uses its own modules' file paths to determine what repository and test suite to check patches against. If you wish to test patches against a repository other than ``openembedded-core`` and/or use a different set of tests, you can use the ``--repodir`` and ``--testdir`` flags::
it_it: Per default, ``patchtest`` utilizza i path dei file dei propri moduli per determinare il repository e la suite di test da utilizzare per il controllo delle patch. Per testare le patch su un repository diverso da ``openembedded-core`` e/o utilizzare un set di test diverso, si possono usare i flag ``--repodir`` e ``--testdir``::

source: By default, all recipes inherit the :ref:`ref-classes-base` and :ref:`ref-classes-package` classes, which enable functionality needed for recipes that produce executable output. If your recipe, for example, only produces packages that contain configuration files, media files, or scripts (e.g. Python and Perl), then it should inherit the :ref:`ref-classes-allarch` class.
it_it: Per default, tutte le ricette ereditano le classi :ref:`ref-classes-base` e :ref:`ref-classes-package`, che abilitano le funzionalità necessarie per le ricette che producono output eseguibile. Se la ricetta, ad esempio, produce solo pacchetti contenenti file di configurazione, file multimediali o script (ad esempio Python e Perl), allora dovrebbe ereditare la classe :ref:`ref-classes-allarch`.

source: By default, everything is accomplished in the :term:`Build Directory`, which has a defined structure. For additional general information on the :term:`Build Directory`, see the ":ref:`structure-core-build`" section in the Yocto Project Reference Manual.
it_it: Per default, tutto viene eseguito nella :term:`Build Directory`, che ha una struttura definita. Per ulteriori informazioni generali sulla :term:`Build Directory`, consultare la sezione ":ref:`structure-core-build`" nel Manuale di Riferimento di Yocto Project.

source: By default, patches created with ``git format-patch`` have a `Git` version signature at the end. To avoid having a `Git` signature at the end of generated or updated patches, you can use `Git` configuration settings::
it_it: Per default, le patch create con ``git format-patch`` hanno una firma di versione `Git` alla fine. Per evitare di avere una firma `Git` alla fine delle patch generate o aggiornate, è possibile utilizzare le impostazioni di configurazione di `Git`::

source: By default, running this script without a :term:`Build Directory` argument creates the ``build/`` directory in your current working directory. If you provide a :term:`Build Directory` argument when you ``source`` the script, you direct the OpenEmbedded build system to create a :term:`Build Directory` of your choice. For example, the following command creates a :term:`Build Directory` named ``mybuilds/`` that is outside of the :term:`Source Directory`::
it_it: Per default, l'esecuzione di questo script senza l'argomento :term:`Build Directory` crea la directory ``build/`` nella directory di lavoro corrente. Se si specifica l'argomento :term:`Build Directory` quando si esegue lo script con ``source``, si indica al sistema di build di OpenEmbedded di creare una :term:`Build Directory` a propria scelta. Ad esempio, il seguente comando crea una :term:`Build Directory` denominata ``mybuilds/`` al di fuori della :term:`Source Directory`::

source: By default, the :ref:`autotools* <ref-classes-autotools>` classes use out-of-tree builds (i.e. ``autotools.bbclass`` building with ``B != S``).
it_it: Per default, le classi :ref:`autotools* <ref-classes-autotools>` utilizzano build out-of-tree (ovvero, ``autotools.bbclass`` viene compilato con ``B != S``).

source: By default, the :term:`Build Directory` contains :term:`TMPDIR`, which is a temporary directory the build system uses for its work. :term:`TMPDIR` cannot be under NFS. Thus, by default, the :term:`Build Directory` cannot be under NFS. However, if you need the :term:`Build Directory` to be under NFS, you can set this up by setting :term:`TMPDIR` in your :ref:`structure-build-conf-site.conf` file to use a local drive. Doing so effectively separates :term:`TMPDIR` from :term:`TOPDIR`, which is the :term:`Build Directory`.
it_it: Per default, la :term:`Build Directory` contiene :term:`TMPDIR`, una directory temporanea utilizzata dal sistema di compilazione. :term:`TMPDIR` non può trovarsi su un server NFS. Pertanto, per default, la :term:`Build Directory` non può trovarsi su un server NFS. Tuttavia, se è necessario che la :term:`Build Directory` si trovi su NFS, è possibile configurarla impostando :term:`TMPDIR` nel file :ref:`structure-build-conf-site.conf` in modo che utilizzi un'unità locale. In questo modo, :term:`TMPDIR` viene effettivamente separato da :term:`TOPDIR`, che rappresenta la :term:`Build Directory`.

source: By default, the OpenEmbedded build system builds one of the two recipes. For the ``bash`` case, version 4.3.30-r0 is built by default. Unfortunately, Toaster as it exists, is not able to override the default recipe version. If you would like to build bash 3.2.48, you need to set the :term:`PREFERRED_VERSION` variable. You can do so from Toaster, using the "Add variable" form, which is available in the "BitBake variables" page of the project configuration section as shown in the following screen:
it_it: Per default, il sistema di build di OpenEmbedded compila una delle due ricette. Nel caso di ``bash``, viene compilata di default la versione 4.3.30-r0. Sfortunatamente, Toaster, nella sua configurazione attuale, non è in grado di sovrascrivere la versione predefinita della ricetta. Per compilare bash 3.2.48, è necessario impostare la variabile :term:`PREFERRED_VERSION`. È possibile farlo da Toaster, utilizzando il modulo "Add variable", disponibile nella pagina "BitBake variables" della sezione di configurazione del progetto, come mostrato nella schermata seguente:

source: By default, the Yocto build system strips symbols from the binaries it packages, which makes it difficult to use some of the tools.
it_it: Per default, il sistema di compilazione Yocto rimuove i simboli dai binari che impacchetta, il che rende difficile l'utilizzo di alcuni tool.

source: By default, this will set up a top directory in the current directory.
it_it: Per default, questo creerà una directory principale nella directory corrente.

source: By design, the OpenEmbedded build system builds everything from scratch unless :term:`BitBake` can determine that parts do not need to be rebuilt. Fundamentally, building from scratch is attractive as it means all parts are built fresh and there is no possibility of stale data that can cause problems. When developers hit problems, they typically default back to building from scratch so they have a known state from the start.
it_it: Per impostazione predefinita, il sistema di build di OpenEmbedded compila tutto da zero, a meno che :term:`BitBake` non riesca a determinare che alcune parti non necessitano di essere ricompilate. Fondamentalmente, la compilazione da zero è vantaggiosa perché significa che tutte le parti vengono compilate da zero e non vi è la possibilità di dati obsoleti che potrebbero causare problemi. Quando gli sviluppatori riscontrano problemi, in genere tornano alla compilazione da zero in modo da avere uno stato noto fin dall'inizio.

source: CVE Examples
it_it: Esempi di CVE

source: CVE patches
it_it: Patch CVE

source: Capturing a command-line build's statistics into the Toaster database for examination later.
it_it: Acquisire le statistiche di una build da riga di comando nel database di Toaster per un'analisi successiva.

source: Capturing a command-line build's statistics when the Toaster server is already running.
it_it: Acquisire le statistiche di una build da riga di comando quando il server Toaster è già in esecuzione.

source: CentOS Stream Packages
it_it: Pacchetti CentOS Stream

source: Challenges
it_it: Sfide

source: Changes will not typically be accepted for branches which are marked as End-Of-Life (EOL).
it_it: In genere, le modifiche non vengono accettate per i branch contrassegnati come End-Of-Life (EOL).

source: Checking Health
it_it: Verifica dello Stato di Salute

source: Checking Status of Builds Completed
it_it: Verifica dello Stato delle Build Completate

source: Checking for Vulnerabilities
it_it: Verifica delle Vulnerabilità

source: Checkout a copy of ``poky`` into the web server directory. You will be using ``/var/www/toaster``::
it_it: Eseguire il checkout di una copia di ``poky`` nella directory del server web. Si userà la directory ``/var/www/toaster``::

source: Checksums (Signatures)
it_it: Checksum (Firme)

source: Checksums and dependencies, as discussed in the previous section, solve half the problem of supporting a shared state. The other half of the problem is being able to use checksum information during the build and being able to reuse or rebuild specific components.
it_it: I checksum e le dipendenze, come discusso nella sezione precedente, risolvono metà del problema del supporto di uno stato condiviso [shared state]. L'altra metà del problema consiste nell'essere in grado di utilizzare le informazioni di checksum durante la compilazione e di riutilizzare o ricompilare componenti specifici.

source: Choose a "Documentation change" item for the bug. Fixing a bug might or might not affect the Yocto Project documentation. If you are unsure of the impact to the documentation, select "Don't Know".
it_it: Selezionare "Documentation change" per il bug. La correzione di un bug potrebbe avere o meno un impatto sulla documentazione di Yocto Project. Se non si è certi dell'impatto sulla documentazione, selezionare "Don't Know".

source: Choose a :term:`DISTRO` (for example, ``poky``):
it_it: Scegliere una :term:`DISTRO` (per esempio, ``poky``):

source: Choose a :term:`bitbake:setup` directory name:
it_it: Scegliere un nome per la directory :term:`bitbake:setup`:

source: Choose a configuration (for example, ``poky-master``):
it_it: Scegliere una configurazione (ad esempio, ``poky-master``):

source: Choose a target :term:`MACHINE` (for example, ``qemux86-64``):
it_it: Scegliere una :term:`MACHINE` target (ad esempio, ``qemux86-64``):

source: Choose the "Architecture" that the bug impacts.
it_it: Scegliere l'"Architecture" interessata dal bug.

source: Choose the "Hardware" that the bug impacts.
it_it: Scegliere l'"Hardware" interessato dal bug.

source: Choose the "Version" of the Yocto Project for which you found the bug (e.g. 6.1).
it_it: Scegliere la "Version" di Yocto Project per cui si è riscontrato il bug (ad esempio, 6.1).

source: Choose the appropriate "Classification", "Product", and "Component" for which the bug was found. Bugs for the Yocto Project fall into one of several classifications, which in turn break down into several products and components. For example, for a bug against the ``meta-intel`` layer, you would choose "Build System, Metadata & Runtime", "BSPs", and "bsps-meta-intel", respectively.
it_it: Scegliere "Classification", "Product" e "Component" appropriati per i quali è stato riscontrato il bug. I bug di Yocto Project rientrano in diverse classificazioni, che a loro volta si suddividono in vari prodotti e componenti. Ad esempio, per un bug relativo al layer ``meta-intel``, si dovrebbe scegliere rispettivamente "Build System, Metadata & Runtime", "BSPs" e "bsps-meta-intel".

source: Class files (``.bbclass``) contain information that is useful to share between recipes files. An example is the :ref:`ref-classes-autotools` class, which contains common settings for any application that is built with the :wikipedia:`GNU Autotools <GNU_Autotools>`. The ":ref:`ref-manual/classes:Classes`" chapter in the Yocto Project Reference Manual provides details about classes and how to use them.
it_it: I file di classe (``.bbclass``) contengono informazioni utili da condividere tra i file di ricetta. Un esempio è la classe :ref:`ref-classes-autotools`, che contiene impostazioni comuni per qualsiasi applicazione compilata con :wikipedia:`GNU Autotools <GNU_Autotools>`. Il capitolo ":ref:`ref-manual/classes:Classes`" nel Manuale di Riferimento di Yocto Project.

source: Class files are used to abstract common functionality and share it amongst multiple recipe (``.bb``) files. To use a class file, you simply make sure the recipe inherits the class. In most cases, when a recipe inherits a class it is enough to enable its features. There are cases, however, where in the recipe you might need to set variables or override some default behavior. A class can also be inherited globally (in every recipe) with the :term:`INHERIT` variable.
it_it: I file di classe vengono utilizzati per astrarre funzionalità comuni e condividerle tra più file di ricetta (``.bb``). Per utilizzare un file di classe, è sufficiente assicurarsi che la ricetta erediti la classe. Nella maggior parte dei casi, quando una ricetta eredita una classe, è sufficiente per abilitarne le funzionalità. Tuttavia, in alcuni casi potrebbe essere necessario impostare delle variabili o sovrascrivere alcuni comportamenti predefiniti all'interno della ricetta. Una classe può anche essere ereditata globalmente (in ogni ricetta) tramite la variabile :term:`INHERIT`.

source: Class files can also be pointed to by :term:`BUILDDIR` (e.g. ``build/``) in the same way as ``.conf`` files in the ``conf`` directory. Class files are searched for in :term:`BBPATH` using the same method by which ``.conf`` files are searched.
it_it: I file di classe possono anche essere indicati tramite :term:`BUILDDIR` (ad esempio ``build/``) nello stesso modo dei file ``build/``nella directory ``conf``. I file di classe vengono cercati in :term:`BBPATH` utilizzando lo stesso metodo impiegato per la ricerca dei file ``.conf``.

source: Classes
it_it: Classi

source: Click "File a Bug" to enter a new bug.
it_it: Cliccare su "File a Bug" per inserire un nuovo bug.

source: Click the "Submit Bug" button submit the bug. A new Bugzilla number is assigned to the bug and the defect is logged in the bug tracking system.
it_it: Cliccare sul pulsante "Submit Bug" per inviare il bug. Al bug verrà assegnato un nuovo numero Bugzilla e il difetto verrà registrato nel sistema di tracciamento dei bug.

source: Clone the Git repository for the component to modify
it_it: Clonare il repository Git del componente da modificare

source: Codenames are associated with major releases because a Yocto Project release number (e.g. 6.1) could conflict with a given layer or company versioning scheme. Codenames are unique, interesting, and easily identifiable.
it_it: I nomi in codice sono associati alle release principali perché un numero di release di Yocto Project (ad esempio 6.1) potrebbe entrare in conflitto con un determinato layer o schema di versioning aziendale. I nomi in codice sono univoci, interessanti e facilmente identificabili.

source: Collecting and Viewing Traces
it_it: Raccolta e Visualizzazione delle Tracce

source: Collecting and viewing a trace on the target (inside a shell)
it_it: Raccolta e visualizzazione di una traccia sul target (all'interno di una shell)

source: Collecting and viewing a user space trace on the target (inside a shell)
it_it: Raccolta e visualizzazione di una traccia dello spazio utente sul target (all'interno di una shell)

source: Collective effort
it_it: Sforzo collettivo

source: Collective effort / openembedded-devel mailing list <openebedded-devel@lists.openembedded.org>
it_it: Sforzo collettivo / mailing list di openembedded-devel <openebedded-devel@lists.openembedded.org>

source: Compatible Linux Distribution
it_it: Distribuzione Linux Compatibile

source: Completing these steps has added the ``meta-raspberrypi`` layer to your Yocto Project development environment and configured it to build for the ``raspberrypi5`` machine.
it_it: Il completamento di questi passaggi ha aggiunto il layer ``meta-raspberrypi`` all'ambiente [environment] di sviluppo di Yocto Project e lo ha configurato per la build per la macchina ``raspberrypi5``.

source: Components and Tools
it_it: Componenti e Tool

source: Concepts and Reference
it_it: Concetti e Riferimenti

source: Configuration, Compilation, and Staging
it_it: Configurazione, Compilazione e Staging

source: Configurations
it_it: Configurazioni

source: Configurations set in the :ref:`structure-build-conf-local.conf` file can also be set in the :ref:`structure-build-conf-site.conf` and :ref:`structure-build-conf-auto.conf` configuration files.
it_it: Le configurazioni impostate nel file :ref:`structure-build-conf-local.conf` possono essere impostate anche nei file di configurazione :ref:`structure-build-conf-site.conf` e :ref:`structure-build-conf-auto.conf`.

source: Configure - set up your environment specifications
it_it: Configure - impostazione delle specifiche dell'ambiente

source: Configure Toaster by editing ``/var/www/toaster/poky/bitbake/lib/toaster/toastermain/settings.py`` as follows:
it_it: Configurare Toaster modificando il file ``/var/www/toaster/poky/bitbake/lib/toaster/toastermain/settings.py`` come segue:

source: Configuring The Build System To Sign Shared State Artifacts
it_it: Configurazione del Sistema di Build per la Firma degli Artefatti di Shared State

source: Configuring Toaster
it_it: Configurazione di Toaster

source: Configuring Toaster to Hook Into Your Layer Index
it_it: Configurazione di Toaster per Agganciarsi al Proprio Indice di Layer

source: Configuring such recipes for all architectures causes the :ref:`do_package_write_* <ref-tasks-package_write_deb>` tasks to have different signatures for the machines with different tunings. Additionally, unnecessary rebuilds occur every time an image for a different :term:`MACHINE` is built even when the recipe never changes.
it_it: Configurare tali ricette per tutte le architetture fa sì che i task :ref:`do_package_write_* <ref-tasks-package_write_deb>` abbiano firme diverse per le macchine con configurazioni diverse. Inoltre, si verificano ricompilazioni non necessarie ogni volta che viene creata un'immagine per una :term:`MACHINE` diversa, anche quando la ricetta non cambia mai.

source: Configuring the Workflow
it_it: Configurazione del Flusso di Lavoro
